Autodesk.Revit.DB.ExternalResourceReferenceDebugModes.DumpMessage(System.String,System.Boolean,System.Boolean,System.Boolean,System.Boolean)
Dump logs to journals, dump file, std out.
message:
The message
bOutputToScreen:
The dumps to output screen, if true.
bOutputToStdFile:
The dumps to standard file, if true.
bOutputToJournal:
The dumps to journal file, if true.
timeStamp:
Prepend time stamp to the message.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2018

Autodesk.Revit.DB.ExternalResourceReferenceDebugModes.ForceNoPermanentIdForDesktopConnector
Disables permanent ids for desktop connector.
Returns:
True to disable warning.
Since:
2018

Autodesk.Revit.DB.ExternalResourceReferenceDebugModes.PostDebugWarnMessage(System.String,System.String,System.String)
Post debug warning message from internal API code
message:
The message
owner:
The owner
date:
The date
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2018

Autodesk.Revit.DB.ExternalResourceReferenceDebugModes.ThrowAutodeskDriveNeedsUpdateException
Throws AutodeskDriveNeedsUpdate exception, which is no way to be triggered before AutodeskDrive and Revit are shipped.
Returns:
True to throw AutodeskDriveNeedsUpdate exception.
Since:
2018

Autodesk.Revit.DB.ExternalResourceReferenceDebugModes.ThrowRevitNeedsUpdateException
Throws RevitNeedsUpdate exception, which is no way to be triggered before AutodeskDrive and Revit are shipped.
Returns:
True to throw RevitNeedsUpdate exception.
Since:
2018

Autodesk.Revit.DB.ExternalResourceReferenceDebugModes.AllowAutodeskDriveLogger
Checks if debug mode is turned on.
Returns:
True if the DebugMode is on.
Since:
2018

Autodesk.Revit.DB.ExternalResourceReferenceDebugModes
This class is an interface to debug modes that are related to ExternalResourceReference.
Remarks:
This class is an interface to debug modes that are related to ExternalResourceReference.
Since:
2018